# -*- encoding: utf-8 -*-
'''
@File : StaffInformation.py
@Time : 2020/03/06 13:49:38
@Author : zjm 
@Version : 1.0
@Contact : 1005564803@qq.com
@WebSite : https://github.com/sum-123/Python-.git
'''

# here put the import lib
# list=[('10001','张三',5,3600),('10002','李四',5,3400),('10003','王武',6,3800),('10004','李林',5,4300),('10005','李华',7,8900),
# ('10006','赵龙',2,6600),('10007','刘虎',3,3300),('10008','刘强',5,9500),('10009','张名',5,3400),('10010','柳青',8,3400)]
# list.sort()
# for a,b,c,d in list:
#     print('工号: ',a,'姓名: ',b,'工龄:',c,'工资:',d)
#以上排序困难
employee=[
    {"工号": "0001", "姓名": "white", "年龄": 19,"工资":7850},
    {"工号": "0002","姓名": "jeney", "年龄": 10,"工资":6500},
    {"工号": "0003","姓名": "marry", "年龄": 20,"工资":8654},
    {"工号": "0004","姓名": "uam", "年龄": 14,"工资":5687},
    {"工号": "0005","姓名": "lack", "年龄": 6,"工资":4532},
    {"工号": "0006","姓名": "som", "年龄": 6,"工资":3800},
    {"工号": "0007","姓名": "murry", "年龄": 20,"工资":8954},
    {"工号": "0008","姓名": "sam", "年龄": 14,"工资":5887},
    {"工号": "0009","姓名": "jace", "年龄": 6,"工资":4732},
    {"工号": "0010","姓名": "toms", "年龄": 6,"工资":3900}
]
employee.sort(key=lambda k:(k.get('工资', 0)),reverse=True)
print(employee)
